example.yml
execution:
- concurrency: 100
  ramp-up: 30s
  hold-for: 1m
  scenario: load-example

scenarios:
  load-example:
    requests:
    - http://blazedemo.com

reporting:
- module: final-stats
  summary: true
  percentiles: true
  summary-labels: false
  failed-labels: false
  test-duration: true
  dump-xml: report.xml
  dump-csv: report.csv